
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
		
	//++ДЗ_Расширения.РасчетСкидки
	Стр = Объект.Товары;
	
	КоэффициентСкидки1 = Объект.ПроцентСкидки_ДЗ / 100;
	КоэффициентСкидки = ТекущиеДанные.Скидка / 100;
	
	Если ЗначениеЗаполнено(Объект.ПроцентСкидки_ДЗ) И Объект.ПроцентСкидки_ДЗ > 0 Тогда	
		Для Каждого Текстрок Из Стр Цикл
			Текскидка = Текстрок.Скидка / 100;
			СуммаКоэффициентов = Текскидка + КоэффициентСкидки1;
			Если СуммаКоэффициентов >= 1 Тогда
				ТекущиеДанные.Сумма = 0;
			Иначе
				Скидка = Текстрок.Цена * Текстрок.Количество * СуммаКоэффициентов;
				Текстрок.Сумма = Текстрок.Цена * Текстрок.Количество - Скидка;
				
				
			КонецЕсли;
			
		КонецЦикла; 
		
	Иначе	
		ТекСкидка = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество - ТекСкидка; 
	КонецЕсли;	

    //--ДЗ_Расширения.РасчетСкидки
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область ДЗ_ДоработкаКода

  &НаКлиенте
Процедура ДЗ_ДЗ_ПроцентСкидкиПриИзменении(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаСкидка",
	ЭтотОбъект);	
	
	ПоказатьВопрос(Оповещение,
	"Пересчитать сумму?",
	РежимДиалогаВопрос.ДаНетОтмена,0, КодВозвратаДиалога.Да);   
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаСкидка(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		РассчитатьСуммуСтроки(ТекущиеДанные);
		
	КонецЕсли;	
КонецПроцедуры



&НаКлиенте
Процедура ПересчитатьСкидкуКоманда(Команда)
  
   Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаКнопка",
	ЭтотОбъект);	
	
	ПоказатьВопрос(Оповещение,
	"Пересчитать сумму?",
	РежимДиалогаВопрос.ДаНетОтмена,0, КодВозвратаДиалога.Да); 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаКнопка(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		РассчитатьСуммуСтроки(ТекущиеДанные);
		
	КонецЕсли;


КонецПроцедуры





#КонецОбласти

